app/controllers/admin/users_controller.rb

  def index
    @admin_users = User.all
---
SELECT `users`.* FROM `users`

  def update
    temp = User.find(params[:id])
    temp.locking = !temp.locking
    temp.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `locking` = 1, `updated_at` = '2014-01-31 02:06:32' WHERE `users`.`id` = 4

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM `users` WHERE `users`.`id` = 2
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1