app/views/creatives/index.html.erb

SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.`id` = `taggings`.`tag_id` WHERE `taggings`.`creative_id` = 3
---
        <td><%= link_to 'Destroy', creative, method: :delete, data: { confirm: 'Are you sure?' } %></td>
        <td><%= raw creative.tags.map(&:name).map { |t| link_to t, tag_path(t) }.join(', ') %></td>