app/controllers/chapters_controller.rb

INSERT INTO `chapters` (`body`, `created_at`, `updated_at`) VALUES ('![zzzzzzz](https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcRgGA5noudQt0jb3p5LjidonjkS6TPyA0fHJLmuy9tECptjpDH4 \"ssssssssss\")kjkajlla', '2014-01-31 20:38:06', '2014-01-31 20:38:06')
---
  def create
    @chapter = Chapter.new(chapter_params)
    @chapter.creative_id = params[:creative_id]
    if @chapter.save

UPDATE `chapters` SET `body` = 'kmdslsmlmsdvmsffff', `updated_at` = '2014-02-03 06:13:09' WHERE `chapters`.`id` = 8
---
  def update
    if @chapter.update(chapter_params)

DELETE FROM `chapters` WHERE `chapters`.`id` = 1
---
  def destroy
    @chapter.destroy

SELECT `chapters`.* FROM `chapters` WHERE (chapters.position IS NOT NULL) AND (1 = 1) ORDER BY chapters.position DESC LIMIT 1
---
    def set_chapter
      @chapter = Chapter.find(params[:id])

SELECT `creatives`.* FROM `creatives` WHERE `creatives`.`id` = 4 ORDER BY `creatives`.`id` ASC LIMIT 1
---
    def set_creative
      @creative = Creative.find(params[:creative_id])