app/controllers/comments_controller.rb

INSERT INTO `comments` (`body`, `created_at`, `creative_id`, `updated_at`, `user_id`) VALUES ('12345', '2014-02-03 11:52:51', 4, '2014-02-03 11:52:51', 3)
---
  def create
    comment = current_user.comments.new(comment_params)
    comment.creative_id = params[:id]
    comment.save