app/controllers/creatives_controller.rb

SELECT `creatives`.* FROM `creatives`
---
  def index
    @creatives = current_user.admin? ? Creative.all : current_user.creatives

INSERT INTO `creatives` (`created_at`, `description`, `title`, `updated_at`, `user_id`) VALUES ('2014-01-31 15:54:19', 'qertyuasdfmzxcvbnm,./asdfghjkl;qwertyuiop', 'ashjkl;\'qwert', '2014-01-31 15:54:19', 3)
---
  def create
    @creative = Creative.new(creative_params)
    @creative.user = current_user
    respond_to do |format|
      if @creative.save

DELETE FROM `creatives` WHERE `creatives`.`id` = 1
---
  def destroy
    @creative.destroy

SELECT `chapters`.* FROM `chapters` WHERE `chapters`.`creative_id` = 4 ORDER BY position
UPDATE `chapters` SET position = (position - 1) WHERE (1 = 1 AND position > 1 AND position <= 2 AND id != '5')
---
  def sort
    @chapters = @creative.chapters
    @chapters.each do |chapter|
      chapter.position = params['chapter'].index(chapter.id.to_s) + 1
      chapter.save

SELECT `creatives`.* FROM `creatives` WHERE `creatives`.`id` = 4 LIMIT 1
---
    def set_creative
      @creative = Creative.find(params[:id])