app/controllers/galleries_controller.rb

  def index
    if current_user.gallery.nil?
      temp = Gallery.new
      temp.user = current_user
      temp.save
      current_user.gallery = temp
      current_user.save
---
INSERT INTO `galleries` (`created_at`, `updated_at`, `user_id`) VALUES ('2014-02-03 01:27:23', '2014-02-03 01:27:23', 3)
UPDATE `users` SET `gallery_id` = 4, `updated_at` = '2014-02-03 01:30:59' WHERE `users`.`id` = 3