app/controllers/home_controller.rb

SELECT `creatives`.* FROM `creatives` INNER JOIN `taggings` ON `creatives`.`id` = `taggings`.`creative_id` WHERE `taggings`.`tag_id` = 1
SELECT tags.*, count(taggings.tag_id) as count FROM `tags` INNER JOIN `taggings` ON `taggings`.`tag_id` = `tags`.`id` GROUP BY taggings.tag_id
---
  def index
    if params[:tag]
      @creatives = Creative.tagged_with(params[:tag])
    else
      @creatives = Creative.all