app/controllers/images_controller.rb

  def create
    image = Image.new(image_params)
    image.gallery = current_user.gallery
    if image.save
---
INSERT INTO `images` (`created_at`, `gallery_id`, `path`, `updated_at`) VALUES ('2014-02-03 01:32:38', 4, 'Bentley-Continental-GTC-Speed-2010.jpg', '2014-02-03 01:32:38')